ishotjr/WhenDi/ble/ble_mk64f.c
#include "ble_mk64f.h"
#include "ble.h"
#include "ble_db_mk64f.h"
#include "ble_mk64f_helpers.h"
#include "atmosphere_platform.h"
#include "nfc.h"

// FreeRTOS Includes
#include "FreeRTOS.h"
#include "semphr.h"
#include "task.h"

#include "SerialManager.h"
#include "MemManager.h"
#include "fsl_os_abstraction.h"
#include "FsciInterface.h"
#include "FunctionLib.h"
#include "ble_sig_defines.h"
#include "cmd_ble.h"
#include "shell.h"
#include "Panic.h"
#include "TimersManager.h"
#include "otap_interface.h"
#include "ble_otap_client.h"
#include "pin_mux.h"
#include "fsl_gpio.h"
#include "fsl_rnga.h"

const ATMO_BLE_DriverInstance_t mk64fBleDriverInstance =
{
	ATMO_MK64F_BLE_PeripheralInit,
	ATMO_MK64F_BLE_PeripheralDeInit,
	ATMO_MK64F_BLE_SetEnabled,
	ATMO_MK64F_BLE_GetEnabled,
	ATMO_MK64F_BLE_GetMacAddress,
	ATMO_MK64F_BLE_GAPSetDeviceName,
	ATMO_MK64F_BLE_GAPAdvertisingStart,
	ATMO_MK64F_BLE_GAPAdvertisingStop,
	ATMO_MK64F_BLE_GAPSetAdvertisedServiceUUID,
	ATMO_MK64F_BLE_GAPAdverertisingSetManufacturerData,
	ATMO_MK64F_BLE_GAPScanConfigure,
	ATMO_MK64F_BLE_GAPScanStart,
	ATMO_MK64F_BLE_GAPScanStop,
	ATMO_MK64F_BLE_GAPScanSetData,
	ATMO_MK64F_BLE_GAPPairingCfg,
	ATMO_MK64F_BLE_GAPPair,
	ATMO_MK64F_BLE_GAPConnect,
	ATMO_MK64F_BLE_GAPDisconnect,
	ATMO_MK64F_BLE_GAPPowerLevelConfigure,
	ATMO_MK64F_BLE_GATTSAddService,
	ATMO_MK64F_BLE_GATTSAddCharacteristic,
	ATMO_MK64F_BLE_GATTSGetCharacteristicValue,
	ATMO_MK64F_BLE_GATTSRegisterCharacteristicCallback,
	ATMO_MK64F_BLE_GATTSRegisterCharacteristicAbilityHandle,
	ATMO_MK64F_BLE_GATTSSetCharacteristic,
	ATMO_MK64F_BLE_GATTSWriteDescriptor,
	ATMO_MK64F_BLE_GATTSSendIndicate,
	ATMO_MK64F_BLE_GATTSSendNotify,
	ATMO_MK64F_BLE_GATTCDiscoverService,
	ATMO_MK64F_BLE_GATTCWriteCharacteristic,
	ATMO_MK64F_BLE_GATTCReadCharacteristic,
	ATMO_MK64F_BLE_GATTCEnableNotification,
	ATMO_MK64F_BLE_RegisterEventCallback,
	ATMO_MK64F_BLE_RegisterEventAbilityHandle
};

#define ATMO_MAX_BLE_CHARACTERISTIC_SIZE (256) // Seems like this platform lets you set the characteristic however big you want
#define ATMO_MAX_CHARACTERISTICS (128)

static ATMO_BLE_MacAddress_t _ATMO_MK64F_MacAddress;

static SemaphoreHandle_t findServiceHandleMutex = NULL;
static SemaphoreHandle_t findCharHandleMutex = NULL;
static SemaphoreHandle_t charReadMutex = NULL;
static SemaphoreHandle_t gattDbConfirmMutex = NULL;
static SemaphoreHandle_t cccdMutex = NULL;
static SemaphoreHandle_t deviceAddressMutex = NULL;
static SemaphoreHandle_t bleInitMutex = NULL;

typedef struct
{
	ATMO_BLE_Handle_t handle;
	ATMO_BLE_Handle_t cccdHandle;
	bool initialized;
	bool notificationsEnabled;
	bool indicationsEnabled;
	ATMO_Callback_t callback;
	uint8_t properties;
	unsigned int abilityHandle;
	bool abilityHandlerRegistered;
} ATMO_CharacteristicInfo_t;

static ATMO_CharacteristicInfo_t characteristics[ATMO_MAX_CHARACTERISTICS] = {0};

static uint32_t currentNumCharacteristics = 0;

static uint16_t latestServiceHandle = 0;
static uint16_t latestCharHandle = 0;
static uint16_t latestCccdHandle = 0;

static uint8_t latestCharDataRead[ATMO_MAX_BLE_CHARACTERISTIC_SIZE];
static uint8_t latestCharDataReadSize = 0;

static bool bleInitialized = false;

#define ATMO_BLE_NUM_CALLBACKS_PER_EVENT (50)
static unsigned int _mk64BleEventAbilityHandle[ATMO_BLE_EVENT_NumEvents][ATMO_BLE_NUM_CALLBACKS_PER_EVENT];
static unsigned int _mk64BleEventNumAbilityHandles[ATMO_BLE_EVENT_NumEvents] = {0};

static ATMO_Callback_t _mk64BleEventCallback[ATMO_BLE_EVENT_NumEvents][ATMO_BLE_NUM_CALLBACKS_PER_EVENT];
static unsigned int _mk64BleEventNumCallbacks[ATMO_BLE_EVENT_NumEvents] = {0};

static bool mk64fBleEnabled = true;
static bool mk64BleEnabledOnBoot = true;

static GAPSetAdvertisingDataRequest_t advData;
#define gGapAdvertisingInterval_050ms_c 0x0050
#define gGapAdvertisingInterval_100ms_c 0x00A0
#define gGapAdvertisingInterval_125ms_c 0x00C8
#define gGapAdvertisingInterval_250ms_c 0x0190
#define gGapAdvertisingInterval_500ms_c 0x0320

static uint8_t connectedDeviceId = 0;
static bool currentlyConnected = false;
static bool pairingInProgress = false;
static tmrTimerID_t resetPairingTmr = gTmrInvalidTimerID_c;
static bool blePostInitComplete = false;

static ATMO_BLE_PairingCfg_t _ATMO_MK64F_BLE_PairingConfig = 
{
	.type = ATMO_BLE_PairingType_RandomKey,
	.pairingKey = 0
};

static ATMO_NFC_Record_t atmoProvisioningRecord;

// Needed for OTA
extern ATMO_BLE_Handle_t otapServiceHandle;
extern ATMO_BLE_Handle_t otapCtrlCharHandle;
extern ATMO_BLE_Handle_t otapDataCharHandle;
uint16_t hServiceOTA;
uint16_t hValueControlPointOTA;
uint16_t hValueOTACCCD;
uint16_t hValueDataOTA;

// Advertising data buffers
static uint8_t _ATMO_BLE_AdvServiceUuidBuf[16];
static uint8_t _ATMO_BLE_AdvFlags = 6;
static uint8_t _ATMO_BLE_DeviceNameBuf[20] = {0};
#define _ATMO_BLE_AD_DEVNAME_INDEX (0)
#define _ATMO_BLE_AD_UUID_INDEX (1)
#define _ATMO_BLE_AD_FLAGS_INDEX (2)
#define _ATMO_BLE_AD_NUM_STRUCTURES (3)



static ATMO_BLE_MacAddress_t deviceAddress;

GAPSetAdvertisingParametersRequest_t advParams =
{
	/* minInterval */         gGapAdvertisingInterval_050ms_c /* 1 s */, \
	/* maxInterval */         gGapAdvertisingInterval_100ms_c /* 1 s */, \
	/* advertisingType */     GAPSetAdvertisingParametersRequest_AdvertisingType_gConnectableUndirected_c, \
	/* addressType */         GAPSetAdvertisingParametersRequest_OwnAddressType_gPublic_c, \
	/* directedAddressType */ GAPSetAdvertisingParametersRequest_PeerAddressType_gPublic_c, \
	/* directedAddress */     {0, 0, 0, 0, 0, 0}, \
	/* channelMap */          GAPSetAdvertisingParametersRequest_ChannelMap_gChannel37_c | GAPSetAdvertisingParametersRequest_ChannelMap_gChannel38_c | GAPSetAdvertisingParametersRequest_ChannelMap_gChannel39_c, \
	/* filterPolicy */        GAPSetAdvertisingParametersRequest_FilterPolicy_gProcessAll_c \
};


#define mcEncryptionKeySize_c   16

GAPSetDefaultPairingParametersRequest_t _ATMO_MK64F_BLE_DefaultPairingParameters =
{
	.PairingParametersIncluded = TRUE,
	.PairingParameters = {
		.WithBonding = TRUE,
		.SecurityModeAndLevel = GAPPairRequest_PairingParameters_SecurityModeAndLevel_gMode1Level3_c,
		.MaxEncryptionKeySize = mcEncryptionKeySize_c,
		.LocalIoCapabilities = GAPPairRequest_PairingParameters_LocalIoCapabilities_gIoDisplayOnly_c,
		.OobAvailable = FALSE,
		.CentralKeys = GAPPairRequest_PairingParameters_CentralKeys_gLtk_c,
		.PeripheralKeys = GAPPairRequest_PairingParameters_PeripheralKeys_gLtk_c,
		.LeSecureConnectionSupported = TRUE,
		.UseKeypressNotifications = FALSE
	}
};


static uint32_t getRandomInteger()
{
	uint32_t randomInt = 0;
	RNGA_GetRandomData(RNG, &randomInt, 4);
	return randomInt;
}

/**
 * Register for "characteristic written" events from the kw41z
 */
static bool ATMO_MK64F_BLE_RegisterWrittenCallbacks();

static uint32_t genRandomKey( uint8_t numDigits )
{
	uint32_t num = 0;

	for( uint8_t i = 0; i < numDigits; i++ )
	{
		num *= 10;
		num += getRandomInteger() % 10;
	}

	return num;
}

/**
 * Given a handle, grab the characteristic info
 */
static ATMO_CharacteristicInfo_t* MK64F_GetCharacteristicByHandle( ATMO_BLE_Handle_t handle )
{
	for ( uint32_t i = 0; i < currentNumCharacteristics; i++ )
	{
		if ( characteristics[i].handle == handle )
		{
			return &characteristics[i];
		}
	}

