ishotjr/WhenDi/ble/ble_mk64f.c
	return NULL;
}

static ATMO_CharacteristicInfo_t* MK64F_GetCharacteristicByCccdHandle( ATMO_BLE_Handle_t handle )
{
	for ( uint32_t i = 0; i < currentNumCharacteristics; i++ )
	{
		if ( characteristics[i].cccdHandle == handle )
		{
			return &characteristics[i];
		}
	}

	return NULL;
}

static void _ATMO_MK64F_BLE_DispatchEvent(ATMO_BLE_Event_t event, ATMO_Value_t *value)
{

	for(unsigned int i = 0; i < _mk64BleEventNumCallbacks[event]; i++)
	{
		ATMO_Lock();
		ATMO_AddCallbackExecute( _mk64BleEventCallback[event][i], value );
		ATMO_Unlock();
	}

	for(unsigned int i = 0; i < _mk64BleEventNumAbilityHandles[event]; i++)
	{
		ATMO_Lock();
		ATMO_AddAbilityExecute( _mk64BleEventAbilityHandle[event][i], value );
		ATMO_Unlock();
	}	
}

// #define ATMO_BLE_DEBUG

/**
 * Handler for any events coming from the KW41Z
 */
void BLE_FSCI_RxCb( void* pData, void* param, uint32_t interfaceId )
{
	bleEvtContainer_t container; // this could be allocated instead
	KHC_BLE_RX_MsgHandler( pData, &container, interfaceId );

#ifdef ATMO_BLE_DEBUG
	if ( 1)
	{
		ATMO_PLATFORM_DebugPrint("RX: %02X\r\n", container.id);
	}
#endif

	switch ( container.id )
	{
		case 0x4580:
		{
			xSemaphoreGive( gattDbConfirmMutex );
			break;
		}

		case 0x4582:
		{
			ATMO_PLATFORM_DebugPrint("RX Service Handle: %02X\r\n", container.Data.GATTDBFindServiceHandleIndication.ServiceHandle);
			latestServiceHandle = container.Data.GATTDBFindServiceHandleIndication.ServiceHandle;
			xSemaphoreGive( findServiceHandleMutex );
			break;
		}

		case 0x4583:
		{
			ATMO_PLATFORM_DebugPrint("RX Char Handle: %02X\r\n", container.Data.GATTDBFindCharValueHandleInServiceIndication.CharValueHandle);
			latestCharHandle = container.Data.GATTDBFindCharValueHandleInServiceIndication.CharValueHandle;
			xSemaphoreGive( findCharHandleMutex );
			break;
		}

		case 0x4584:
		{
			ATMO_PLATFORM_DebugPrint( "\r\nGATTDBFindCccdHandleForCharValueHandleIndication" );
			latestCccdHandle = container.Data.GATTDBFindCccdHandleForCharValueHandleIndication.CccdHandle;
			xSemaphoreGive(cccdMutex);
			break;
		}

		case 0x4493:
		{
			GATTServerAttributeWrittenIndication_t* event = &container.Data.GATTServerAttributeWrittenIndication;

			GATTDBWriteAttributeRequest_t req;

			req.Handle = event->AttributeWrittenEvent.Handle;
			req.ValueLength = event->AttributeWrittenEvent.ValueLength;
			req.Value = event->AttributeWrittenEvent.Value;

			GATTDBWriteAttributeRequest( &req, BLE_FSCI_IF );

			GATTServerSendAttributeWrittenStatusRequest_t statusReq;

			statusReq.DeviceId = event->DeviceId;
			statusReq.AttributeHandle = event->AttributeWrittenEvent.Handle;
			statusReq.Status = 0;

			if (event->AttributeWrittenEvent.Handle !=  hValueControlPointOTA)
			{
				GATTServerSendAttributeWrittenStatusRequest( &statusReq, BLE_FSCI_IF );
			}

			ATMO_BLE_Handle_t handle;
			ATMO_BLE_DB_MK64F_Kw41zHandleToAtmo( &event->AttributeWrittenEvent.Handle, &handle );

			ATMO_CharacteristicInfo_t* characteristic = MK64F_GetCharacteristicByHandle( handle );

			if ( characteristic->abilityHandlerRegistered )
			{
				ATMO_Value_t data;
				ATMO_InitValue( &data );
				ATMO_CreateValueBinary( &data, event->AttributeWrittenEvent.Value, event->AttributeWrittenEvent.ValueLength );
				ATMO_Lock();
				ATMO_AddAbilityExecute( characteristic->abilityHandle, &data );
				ATMO_Unlock();
				ATMO_Free(&data);
			}

			if ( characteristic->callback != NULL )
			{
				ATMO_Value_t data;
				ATMO_InitValue( &data );
				ATMO_CreateValueBinary( &data, event->AttributeWrittenEvent.Value, event->AttributeWrittenEvent.ValueLength );
				ATMO_Lock();
				ATMO_AddCallbackExecute( characteristic->callback, &data );
				ATMO_Unlock();
				ATMO_Free(&data);
			}

		    else if (event->AttributeWrittenEvent.Handle ==  hValueControlPointOTA)
		    {
		        BleApp_AttributeWritten(event->DeviceId,
		        		event->AttributeWrittenEvent.Handle,
						event->AttributeWrittenEvent.ValueLength,
						event->AttributeWrittenEvent.Value);
		    }

			MEM_BufferFree( event->AttributeWrittenEvent.Value );


			break;
		}

        case 0x4491:
            BleApp_AttMtuChanged(container.Data.GATTServerMtuChangedIndication.DeviceId,
                                 container.Data.GATTServerMtuChangedIndication.MtuChangedEvent_NewMtu);
            break;

        case 0x4492:
            BleApp_HandleValueConfirmation(container.Data.GATTServerHandleValueConfirmationIndication.DeviceId);
            break;

        case 0x4494:
            ATMO_PLATFORM_DebugPrint("\r\nGATTServerCharacteristicCccdWrittenIndication");
            BleApp_CccdWritten(container.Data.GATTServerCharacteristicCccdWrittenIndication.DeviceId,
                               container.Data.GATTServerCharacteristicCccdWrittenIndication.CharCccdWrittenEvent.Handle);

            ATMO_PLATFORM_DebugPrint("Getting char for CCCD handle %02X\r\n", container.Data.GATTServerCharacteristicCccdWrittenIndication.CharCccdWrittenEvent.Handle);

			ATMO_CharacteristicInfo_t* characteristic = MK64F_GetCharacteristicByCccdHandle( container.Data.GATTServerCharacteristicCccdWrittenIndication.CharCccdWrittenEvent.Handle );

			if(characteristic != NULL)
			{
				characteristic->notificationsEnabled = (container.Data.GATTServerCharacteristicCccdWrittenIndication.CharCccdWrittenEvent.NewCccd & GATTServerCharacteristicCccdWrittenIndication_CharCccdWrittenEvent_NewCccd_gCccdNotification_c);
				characteristic->indicationsEnabled = (container.Data.GATTServerCharacteristicCccdWrittenIndication.CharCccdWrittenEvent.NewCccd & GATTServerCharacteristicCccdWrittenIndication_CharCccdWrittenEvent_NewCccd_gCccdIndication_c);
				ATMO_PLATFORM_DebugPrint("Handle: %02X Notifications: %d Indications: %d\r\n", characteristic->handle, characteristic->notificationsEnabled, characteristic->indicationsEnabled);
			}

            break;

        case 0x4495:
            BleApp_AttributeWrittenWithoutResponse(container.Data.GATTServerAttributeWrittenWithoutResponseIndication.DeviceId,
                            container.Data.GATTServerAttributeWrittenWithoutResponseIndication.AttributeWrittenEvent.Handle,
                            container.Data.GATTServerAttributeWrittenWithoutResponseIndication.AttributeWrittenEvent.ValueLength,
                            container.Data.GATTServerAttributeWrittenWithoutResponseIndication.AttributeWrittenEvent.Value);
            MEM_BufferFree(container.Data.GATTServerAttributeWrittenWithoutResponseIndication.AttributeWrittenEvent.Value);
            break;


        case 0x4794:
        {
        	for(int i = 0; i < 6; i++)
        	{
        		deviceAddress.data[i] = container.Data.GAPGenericEventPublicAddressReadIndication.Address[5 - i];
        	}

            xSemaphoreGive(deviceAddressMutex);
            break;
        }

		case 0x47A4:
		{
			pairingInProgress = true;
			char msg[64];
			sprintf( msg, "BLE Passkey: %d\r\n", container.Data.GAPConnectionEventPasskeyDisplayIndication.PasskeyForDisplay );
			
			ATMO_Value_t atmoKey;
			ATMO_InitValue(&atmoKey);
			ATMO_CreateValueUnsignedInt(&atmoKey, container.Data.GAPConnectionEventPasskeyDisplayIndication.PasskeyForDisplay);
			_ATMO_MK64F_BLE_DispatchEvent(ATMO_BLE_EVENT_PairingRequested, &atmoKey);
			ATMO_FreeValue(&atmoKey);
			
			break;
		}

		case 0x47A9:
		{
			pairingInProgress = false;

