ishotjr/WhenDi/ble/ble_mk64f.c
			if(container.Data.GAPConnectionEventPairingCompleteIndication.PairingStatus == GAPConnectionEventPairingCompleteIndication_PairingStatus_PairingSuccessful)
			{
				_ATMO_MK64F_BLE_DispatchEvent(ATMO_BLE_EVENT_PairingSuccess, NULL);
			}
			else
			{
				_ATMO_MK64F_BLE_DispatchEvent(ATMO_BLE_EVENT_PairingFailed, NULL);
			}
		}
		case 0x47A1:
		{
			if(pairingInProgress)
			{
				_ATMO_MK64F_BLE_DispatchEvent(ATMO_BLE_EVENT_PairingFailed, NULL);
			}
			pairingInProgress = false;
			break;

		}

		case 0x4780:
		{
			xSemaphoreGive(bleInitMutex);
			break;
		}

		case 0x4581:
		{
			memcpy( latestCharDataRead, container.Data.GATTDBReadAttributeIndication.Value,
			        container.Data.GATTDBReadAttributeIndication.ValueLength );
			latestCharDataReadSize = container.Data.GATTDBReadAttributeIndication.ValueLength;
			xSemaphoreGive( charReadMutex );
			break;
		}

		case 0x479D:
		{
			ATMO_PLATFORM_DebugPrint( "GAPConnectionEventConnectedIndication\r\n" );

			uint32_t key = 0;

			if(_ATMO_MK64F_BLE_PairingConfig.type == ATMO_BLE_PairingType_RandomKey)
			{
				key = genRandomKey( 6 );
			}
			else if(_ATMO_MK64F_BLE_PairingConfig.type == ATMO_BLE_PairingType_UserKey)
			{
				key = _ATMO_MK64F_BLE_PairingConfig.pairingKey;
			}

			GAPSetLocalPasskeyRequest_t req_pass = {key};
			GAPSetLocalPasskeyRequest( &req_pass, BLE_FSCI_IF );

			connectedDeviceId = container.Data.GAPConnectionEventConnectedIndication.DeviceId;
			currentlyConnected = true;
			OtapCS_Subscribe(connectedDeviceId);
			BleApp_CccdWritten_lazy();

			_ATMO_MK64F_BLE_DispatchEvent(ATMO_BLE_EVENT_Connected, NULL);

			break;
		}

		case 0x479E:
		{
			ATMO_PLATFORM_DebugPrint( "GAPConnectionEventPairingRequestIndication\r\n" );
			break;
		}

		case 0x47AA:
		{
			ATMO_PLATFORM_DebugPrint( "Disconnected\r\n" );
			OtapClient_HandleDisconnectionEvent (container.Data.GAPConnectionEventDisconnectedIndication.DeviceId);
			currentlyConnected = false;

			_ATMO_MK64F_BLE_DispatchEvent(ATMO_BLE_EVENT_Disconnected, NULL);

			break;
		}

		case 0x4496:
		{
			ATMO_PLATFORM_DebugPrint( "\r\nGATTServerErrorIndication " );
			break;
		}
	}
}

static void ATMO_MK64F_BLE_RegisterForWriteNotifications( uint8_t count, uint8_t* handles )
{
	GATTServerRegisterHandlesForWriteNotificationsRequest_t req;

	if ( count == 0 )
	{
		return;
	}

	req.HandleCount = count;
	req.AttributeHandles = handles;

	GATTServerRegisterHandlesForWriteNotificationsRequest( &req, BLE_FSCI_IF );
}

/**
 * Given a UUID, find the handle associated with that service
 *
 * BLOCKING
 *
 * @param[in] uuid
 * @param[out] handle
 *
 * @return true on success, false on error
 */
static bool MK64F_FindServiceHandle( ATMO_UUID_t* uuid, ATMO_BLE_Handle_t* handle )
{
	GATTDBFindServiceHandleRequest_t req;
	req.StartHandle = 0x0001;  // should be 0x0001 on the first call

	if( uuid->type == ATMO_UUID_Type_16_Bit )
	{
		memcpy( req.Uuid.Uuid16Bits, uuid->data, 2 );
		req.UuidType = Uuid16Bits;
	}
	else
	{
		memcpy( req.Uuid.Uuid128Bits, uuid->data, 16 );
		req.UuidType = Uuid128Bits;
	}

	GATTDBFindServiceHandleRequest( &req, BLE_FSCI_IF );

	// Wait a second for the result to come back in
	if ( xSemaphoreTake( findServiceHandleMutex,
	                     1000 / portTICK_PERIOD_MS ) == pdTRUE )
	{
		*handle = latestServiceHandle;
	}
	else
	{
		return false;
	}


	return true;
}

static bool MK64F_FindCharCccdHandle( ATMO_BLE_Handle_t handle, ATMO_BLE_Handle_t* cccdHandle )
{
	GATTDBFindCccdHandleForCharValueHandleRequest_t findcccdReq;
	findcccdReq.CharValueHandle = handle;
	GATTDBFindCccdHandleForCharValueHandleRequest( &findcccdReq, BLE_FSCI_IF );

	if( xSemaphoreTake( cccdMutex, 1000 / portTICK_PERIOD_MS ) != pdTRUE )
	{
		shell_printf( "Didn't get response in time\r\n" );
		return false;
	}

	*cccdHandle = latestCccdHandle;
	return true;
}

bool ATMO_MK64F_BLE_GetCccdHandles()
{
	for( uint32_t i = 0; i < currentNumCharacteristics; i++ )
	{
		if( characteristics[i].properties & ( ATMO_BLE_Property_Notify | ATMO_BLE_Property_Indicate ) )
		{
			ATMO_BLE_Handle_t kw41zHandle;
			ATMO_BLE_DB_MK64F_AtmoHandleToKw41z( &characteristics[i].handle, &kw41zHandle );

			if( !MK64F_FindCharCccdHandle( kw41zHandle, &characteristics[i].cccdHandle ) )
			{
				return false;
			}

			shell_printf("CCCD[%d] Atmo Handle %02X Kw41z Handle %02X CCCD Handle: %02X\r\n", i, characteristics[i].handle, kw41zHandle, characteristics[i].cccdHandle);
		}
	}

	return true;
}
/**
 * Given a UUID, find the handle associated with that characteristic
 *
 * BLOCKING
 *
 * @param[in] uuid
 * @param[in] serviceHandle - Handle of parent service
 * @param[out] handle
 *
 * @return true on success, false on error
 */
static bool MK64F_FindCharHandle( ATMO_UUID_t* uuid, ATMO_BLE_Handle_t serviceHandle, ATMO_BLE_Handle_t* handle )
{
	GATTDBFindCharValueHandleInServiceRequest_t req;
	req.ServiceHandle = serviceHandle;

	if( uuid->type == ATMO_UUID_Type_16_Bit )
	{
		memcpy( req.Uuid.Uuid16Bits, uuid->data, 2 );
		req.UuidType = Uuid16Bits;
	}
	else
	{
		memcpy( req.Uuid.Uuid128Bits, uuid->data, 16 );
		req.UuidType = Uuid128Bits;
	}

	GATTDBFindCharValueHandleInServiceRequest( &req, BLE_FSCI_IF );

	// Wait a second for the result to come back in
	if ( xSemaphoreTake( findCharHandleMutex,
	                     1000 / portTICK_PERIOD_MS ) == pdTRUE )
	{
		*handle = latestCharHandle;
	}
	else
	{
		return false;
	}


	return true;
}

bool ATMO_MK64F_BLE_SetAllServiceChanged()
{
	ATMO_MK64F_BLE_SetServiceChanged( 0, latestCharHandle );
	return true;
}

ATMO_Status_t ATMO_MK64F_BLE_AddDriverInstance( ATMO_DriverInstanceHandle_t* instanceNumber )
{
	static ATMO_DriverInstanceData_t driverData;
	driverData.name = "MK64F BLE";
	driverData.initialized = false;
	driverData.instanceNumber = 0;
	driverData.argument = NULL;

	return ATMO_BLE_AddDriverInstance( &mk64fBleDriverInstance, &driverData, instanceNumber );
}

ATMO_BLE_Status_t ATMO_MK64F_BLE_PeripheralInit( ATMO_DriverInstanceData_t* instance )
{
	if ( bleInitialized )
	{
		return ATMO_BLE_Status_Success;
	}

	// Initialize mutexes to create sync API
	findServiceHandleMutex = xSemaphoreCreateBinary();
	findCharHandleMutex = xSemaphoreCreateBinary();
	charReadMutex = xSemaphoreCreateBinary();
	gattDbConfirmMutex = xSemaphoreCreateBinary();
	cccdMutex = xSemaphoreCreateBinary();
	deviceAddressMutex = xSemaphoreCreateBinary();
	bleInitMutex = xSemaphoreCreateBinary();

