ishotjr/WhenDi/ble/ble_mk64f.c
	// Init advdata
	static uint8_t adStructData[sizeof(advData.AdvertisingData.AdStructures[0]) * (_ATMO_BLE_AD_NUM_STRUCTURES)];
	advData.AdvertisingData.AdStructures = (void *)adStructData;
	advData.AdvertisingDataIncluded = true;
	advData.ScanResponseDataIncluded = false;
	advData.AdvertisingData.NbOfAdStructures = _ATMO_BLE_AD_NUM_STRUCTURES;

	ATMO_PLATFORM_DebugPrint( "Initializing BLE\r\n" );

	unsigned int maxMacAddressRetries = 5;

	for(int i = 0; i < maxMacAddressRetries; i++)
	{
		// Try to get the MAC address
		GAPReadPublicDeviceAddressRequest(BLE_FSCI_IF);

		// Wait a second for the result to come back in
		if ( xSemaphoreTake( deviceAddressMutex,
		                     1000 / portTICK_PERIOD_MS ) == pdTRUE )
		{
			bleInitialized = true;
			ATMO_PLATFORM_DebugPrint("Got MAC Address: %02X:%02X:%02X:%02X:%02X:%02X\r\n", deviceAddress.data[0],
					deviceAddress.data[1],
					deviceAddress.data[2],
					deviceAddress.data[3],
					deviceAddress.data[4],
					deviceAddress.data[5]);
			ATMO_PLATFORM_DebugPrint("BLE Initialized\r\n");
			memcpy(&_ATMO_MK64F_MacAddress, &deviceAddress, sizeof(deviceAddress));
			break;
		}
		else
		{
			ATMO_PLATFORM_DebugPrint("Failed To Get MAC (Attempt %d/%d)\r\n", i + 1, maxMacAddressRetries);
		}
	}

	GATTServerRegisterCallbackRequest( BLE_FSCI_IF );

	// Initialize virtual DB
	ATMO_BLE_DB_MK64F_Init();
	ATMO_BLE_DB_MK64F_RegisterFuncs( ATMO_MK64F_BLE_PrivAddService, ATMO_MK64F_BLE_PrivAddCharacteristic,
	                                 ATMO_MK64F_BLE_RegisterWrittenCallbacks );

	ATMO_MK64F_BLE_AddAuthService();
	ATMO_MK64F_BLE_AddOtapService();
	ATMO_MK64F_BLE_AddDefaultServices();

	RNGA_Init(RNG);

	
	return ATMO_BLE_Status_Success;
}

ATMO_BLE_Status_t ATMO_MK64F_BLE_SetEnabledOnBoot( ATMO_DriverInstanceData_t *instance, bool enabled )
{
	mk64BleEnabledOnBoot = enabled;
	return ATMO_BLE_Status_Success;
}

ATMO_BLE_Status_t ATMO_MK64F_BLE_SetEnabled( ATMO_DriverInstanceData_t *instance, bool enabled )
{
	// Write to the flash
	ATMO_FILESYSTEM_File_t file;
	if( ATMO_FILESYSTEM_FileOpen(0, &file, "ble_enabled", ATMO_CREAT | ATMO_RDWR | ATMO_TRUNC ) != ATMO_FILESYSTEM_Status_Success )
	{
		return ATMO_BLE_Status_Fail;
	}

	if( ATMO_FILESYSTEM_FileWrite(0, &file, &enabled, sizeof(enabled)) != ATMO_FILESYSTEM_Status_Success )
	{
		ATMO_FILESYSTEM_FileClose(0, &file);
		return ATMO_BLE_Status_Fail;
	}

	ATMO_FILESYSTEM_FileClose(0, &file);

	mk64fBleEnabled = enabled;

	if(!enabled)
	{
		// Disconnect and stop advertising
		if(currentlyConnected)
		{
			GAPDisconnectRequest_t req;
			req.DeviceId = connectedDeviceId;  // the connected peer to disconnect from
			GAPDisconnectRequest(&req, BLE_FSCI_IF);
		}
		
		ATMO_MK64F_BLE_GAPAdvertisingStop(NULL);
		
	}
	return ATMO_BLE_Status_Success;
}

ATMO_BLE_Status_t ATMO_MK64F_BLE_GetEnabled( ATMO_DriverInstanceData_t *instance, bool *enabled )
{
	*enabled = true;

	ATMO_FILESYSTEM_File_t file;

	ATMO_FILESYSTEM_Status_t status = ATMO_FILESYSTEM_FileOpen(0, &file, "ble_enabled", ATMO_RDONLY );

	if(status != ATMO_FILESYSTEM_Status_Success)
	{
		return ATMO_BLE_Status_Fail;
	}

	if( ATMO_FILESYSTEM_FileRead(0, &file, enabled, sizeof(enabled)) != ATMO_FILESYSTEM_Status_Success )
	{
		ATMO_PLATFORM_DebugPrint("Read From ble_enabled: %d\r\n", *enabled);
		ATMO_FILESYSTEM_FileClose(0, &file);
		return ATMO_BLE_Status_Fail;
	}

	ATMO_FILESYSTEM_FileClose(0, &file);
	return ATMO_BLE_Status_Success;
}

void ATMO_MK64F_BLE_PostInit()
{
	if((!mk64BleEnabledOnBoot) || (!mk64fBleEnabled))
	{
		return;
	}

	// Register Atmosphere NFC Provisioning Record
	unsigned int recordHandle = 0;
	ATMO_NFC_RegisterStoredRecord(0, &atmoProvisioningRecord, &recordHandle);
	ATMO_NFC_MakeRecordMime(&atmoProvisioningRecord, "application/atmoiotprov", "N/A", strlen("N/A"));

	blePostInitComplete = true;

	ATMO_BLE_DB_MK64F_Flush();
	ATMO_MK64F_BLE_GetCccdHandles();
	ATMO_BLE_AdvertisingParams_t params;
	params.advertisingInterval = 1600;
	params.type = ATMO_BLE_ADV_TYPE_INDIRECT;
	ATMO_BLE_GAPAdvertisingStart(0, &params);
	ATMO_MK64F_BLE_SetAllServiceChanged();

	// OTAP module needs to know the various handles
	ATMO_BLE_DB_MK64F_AtmoHandleToKw41z(&otapServiceHandle, &hServiceOTA);
	ATMO_BLE_DB_MK64F_AtmoHandleToKw41z(&otapCtrlCharHandle, &hValueControlPointOTA);
	ATMO_BLE_DB_MK64F_AtmoHandleToKw41z(&otapDataCharHandle, &hValueDataOTA);

	ATMO_CharacteristicInfo_t *otaCtrlChar = MK64F_GetCharacteristicByHandle(otapCtrlCharHandle);
	if(otaCtrlChar)
	{
		hValueOTACCCD = otaCtrlChar->cccdHandle;
	}
}

ATMO_BLE_Status_t ATMO_MK64F_BLE_PeripheralDeInit( ATMO_DriverInstanceData_t* instance )
{
	return ATMO_BLE_Status_NotSupported;
}

ATMO_BLE_Status_t ATMO_MK64F_BLE_GetMacAddress( ATMO_DriverInstanceData_t *instance, ATMO_BLE_MacAddress_t *address )
{
	if((!mk64BleEnabledOnBoot) || (!mk64fBleEnabled))
	{
		return ATMO_BLE_Status_Fail;
	}

	memcpy(address, &_ATMO_MK64F_MacAddress, sizeof(_ATMO_MK64F_MacAddress));
	
	return ATMO_BLE_Status_Success;
}

ATMO_BLE_Status_t ATMO_MK64F_BLE_GAPSetDeviceName( ATMO_DriverInstanceData_t* instance, const char* name )
{
	if((!mk64BleEnabledOnBoot) || (!mk64fBleEnabled))
	{
		return ATMO_BLE_Status_Fail;
	}
	
	if(strlen(name) >= sizeof(_ATMO_BLE_DeviceNameBuf))
	{
		return ATMO_BLE_Status_Fail;
	}

	advData.AdvertisingData.AdStructures[_ATMO_BLE_AD_DEVNAME_INDEX].Length = strlen(name);
	advData.AdvertisingData.AdStructures[_ATMO_BLE_AD_DEVNAME_INDEX].Type = GAPSetAdvertisingDataRequest_AdvertisingData_AdStructures_Type_gAdShortenedLocalName_c;
	advData.AdvertisingData.AdStructures[_ATMO_BLE_AD_DEVNAME_INDEX].Data = _ATMO_BLE_DeviceNameBuf;
	memcpy(_ATMO_BLE_DeviceNameBuf, name, strlen(name));

	return ATMO_BLE_Status_Success;
}

ATMO_BLE_Status_t ATMO_MK64F_BLE_GAPAdvertisingStart( ATMO_DriverInstanceData_t* instance,
        ATMO_BLE_AdvertisingParams_t* params )
{
	if((!mk64BleEnabledOnBoot) || (!mk64fBleEnabled))
	{
		return ATMO_BLE_Status_Fail;
	}

	GAPSetDefaultPairingParametersRequest( &_ATMO_MK64F_BLE_DefaultPairingParameters, BLE_FSCI_IF );

	// TODO nick set adversiting type
	advParams.MinInterval = params->advertisingInterval;
	advParams.MaxInterval = params->advertisingInterval;


	advData.AdvertisingData.AdStructures[_ATMO_BLE_AD_FLAGS_INDEX].Length = 1;
	advData.AdvertisingData.AdStructures[_ATMO_BLE_AD_FLAGS_INDEX].Type = GAPSetAdvertisingDataRequest_AdvertisingData_AdStructures_Type_gAdFlags_c;
	advData.AdvertisingData.AdStructures[_ATMO_BLE_AD_FLAGS_INDEX].Data = &_ATMO_BLE_AdvFlags;

