ishotjr/WhenDi/ble/ble_mk64f.c
#ifdef ATMO_BLE_ADV_DEBUG
		ATMO_MK64F_BLE_PrintAdvData(&advData);
#endif

	GAPSetAdvertisingDataRequest( &advData, BLE_FSCI_IF );

	GAPSetAdvertisingParametersRequest( &advParams, BLE_FSCI_IF );

	if(blePostInitComplete)
	{
		GAPStartAdvertisingRequest( BLE_FSCI_IF );
	}

	char advUuidStr[37] = {0};
	ATMO_UUID_t advServiceUuid;
	advServiceUuid.endianness = ATMO_ENDIAN_Type_Little;
	advServiceUuid.type = ATMO_UUID_Type_128_Bit;
	memcpy(advServiceUuid.data, _ATMO_BLE_AdvServiceUuidBuf, 16);

	if(ATMO_UuidToString(&advServiceUuid, advUuidStr, 37) != ATMO_Status_Success)
	{
		return ATMO_BLE_Status_Fail;
	}

	char advRecord[128];
	sprintf(advRecord, "{\"name\":\"%s\",\"uuid\":\"%s\", \"type\":\"ble\"}", _ATMO_BLE_DeviceNameBuf, advUuidStr);
	ATMO_NFC_MakeRecordMime(&atmoProvisioningRecord, "application/atmoiotprov", advRecord, strlen(advRecord));
	ATMO_NFC_SyncAtmoRecords(0);

	return ATMO_BLE_Status_Success;
}

ATMO_BLE_Status_t ATMO_MK64F_BLE_GAPAdvertisingStop( ATMO_DriverInstanceData_t* instance )
{
	GAPStopAdvertisingRequest(BLE_FSCI_IF);
	return ATMO_BLE_Status_Success;
}

ATMO_BLE_Status_t ATMO_MK64F_BLE_GAPSetAdvertisedServiceUUID( ATMO_DriverInstanceData_t* instance, const char* uuid )
{
	if((!mk64BleEnabledOnBoot) || (!mk64fBleEnabled))
	{
		return ATMO_BLE_Status_Fail;
	}

	ATMO_PLATFORM_DebugPrint("Setting advertised UUID: %s\r\n", uuid);

	ATMO_UUID_t uuidBin;

	// Convert string UUID to binary form
	if ( ATMO_StringToUuid( uuid, &uuidBin, ATMO_ENDIAN_Type_Little ) == ATMO_Status_Success )
	{
		advData.AdvertisingData.AdStructures[_ATMO_BLE_AD_UUID_INDEX].Length = 16;
		advData.AdvertisingData.AdStructures[_ATMO_BLE_AD_UUID_INDEX].Type = GAPSetAdvertisingDataRequest_AdvertisingData_AdStructures_Type_gAdIncomplete128bitServiceList_c;
		advData.AdvertisingData.AdStructures[_ATMO_BLE_AD_UUID_INDEX].Data = _ATMO_BLE_AdvServiceUuidBuf;
		memcpy(_ATMO_BLE_AdvServiceUuidBuf, uuidBin.data, 16);

#ifdef ATMO_BLE_ADV_DEBUG
		ATMO_MK64F_BLE_PrintAdvData(&advData);
#endif
	}
	else
	{
		return ATMO_BLE_Status_Fail;
	}

	return ATMO_BLE_Status_Success;
}

ATMO_BLE_Status_t ATMO_MK64F_BLE_GAPAdverertisingSetManufacturerData( ATMO_DriverInstanceData_t* instance,
        ATMO_BLE_AdvertisingData_t* data )
{
	if((!mk64BleEnabledOnBoot) || (!mk64fBleEnabled))
	{
		return ATMO_BLE_Status_Fail;
	}

	return ATMO_BLE_Status_NotSupported;

}

ATMO_BLE_Status_t ATMO_MK64F_BLE_GAPScanConfigure( ATMO_DriverInstanceData_t* instance, ATMO_BLE_ScanParams_t* params )
{
	return ATMO_BLE_Status_NotSupported;
}

ATMO_BLE_Status_t ATMO_MK64F_BLE_GAPScanStart( ATMO_DriverInstanceData_t* instance, uint32_t length )
{
	return ATMO_BLE_Status_NotSupported;
}

ATMO_BLE_Status_t ATMO_MK64F_BLE_GAPScanStop( ATMO_DriverInstanceData_t* instance )
{
	return ATMO_BLE_Status_NotSupported;
}

ATMO_BLE_Status_t ATMO_MK64F_BLE_GAPScanSetData( ATMO_DriverInstanceData_t* instance, ATMO_BLE_ScanData_t* data )
{
	return ATMO_BLE_Status_NotSupported;
}

ATMO_BLE_Status_t ATMO_MK64F_BLE_GAPPairingCfg( ATMO_DriverInstanceData_t* instance, ATMO_BLE_PairingCfg_t* config )
{
	GAPSetDefaultPairingParametersRequest_t gPairingParameters =
	{
		.PairingParametersIncluded = TRUE,
		.PairingParameters = {
			.WithBonding = TRUE,
			.SecurityModeAndLevel = GAPPairRequest_PairingParameters_SecurityModeAndLevel_gMode1Level3_c,
			.MaxEncryptionKeySize = mcEncryptionKeySize_c,
			.LocalIoCapabilities = GAPPairRequest_PairingParameters_LocalIoCapabilities_gIoDisplayOnly_c,
			.OobAvailable = FALSE,
			.CentralKeys = GAPPairRequest_PairingParameters_CentralKeys_gLtk_c,
			.PeripheralKeys = GAPPairRequest_PairingParameters_PeripheralKeys_gLtk_c,
			.LeSecureConnectionSupported = TRUE,
			.UseKeypressNotifications = FALSE
		}
	};

	if(config->type == ATMO_BLE_PairingType_JustWorks)
	{
		gPairingParameters.PairingParameters.LocalIoCapabilities = GAPPairRequest_PairingParameters_LocalIoCapabilities_gIoNone_c;
	}
	else if(config->type == ATMO_BLE_PairingType_RandomKey || config->type == ATMO_BLE_PairingType_UserKey)
	{
		gPairingParameters.PairingParameters.LocalIoCapabilities = GAPPairRequest_PairingParameters_LocalIoCapabilities_gIoDisplayOnly_c;
	}
	else
	{
		return ATMO_BLE_Status_Invalid;
	}

	memcpy(&_ATMO_MK64F_BLE_PairingConfig, config, sizeof(ATMO_BLE_PairingCfg_t));

	GAPSetDefaultPairingParametersRequest( &gPairingParameters, BLE_FSCI_IF );
	return ATMO_BLE_Status_Success;
}

ATMO_BLE_Status_t ATMO_MK64F_BLE_GAPPair( ATMO_DriverInstanceData_t* instance )
{
	return ATMO_BLE_Status_NotSupported;
}

ATMO_BLE_Status_t ATMO_MK64F_BLE_GAPConnect( ATMO_DriverInstanceData_t* instance, ATMO_BLE_DeviceID_t scannedDeviceID )
{
	return ATMO_BLE_Status_NotSupported;
}

ATMO_BLE_Status_t ATMO_MK64F_BLE_GAPDisconnect( ATMO_DriverInstanceData_t* instance )
{
	if(currentlyConnected)
	{
		GAPDisconnectRequest_t req;
		req.DeviceId = connectedDeviceId;  // the connected peer to disconnect from
		GAPDisconnectRequest(&req, BLE_FSCI_IF);
	}
	return ATMO_BLE_Status_Success;
}

ATMO_BLE_Status_t ATMO_MK64F_BLE_GAPPowerLevelConfigure( ATMO_DriverInstanceData_t* instance,
        ATMO_BLE_PowerLevel_t advertisingTxPower,
        ATMO_BLE_PowerLevel_t connectionTxPower )
{
	return ATMO_BLE_Status_NotSupported;
}

bool ATMO_MK64F_BLE_PrivAddService( ATMO_UUID_t* uuid, ATMO_BLE_Handle_t* handle )
{
	if((!mk64BleEnabledOnBoot) || (!mk64fBleEnabled))
	{
		return ATMO_BLE_Status_Fail;
	}

	GATTDBDynamicAddPrimaryServiceDeclarationRequest_t req;

	if( uuid->type == ATMO_UUID_Type_16_Bit )
	{
		memcpy( req.Uuid.Uuid16Bits, uuid->data, 2 );
		req.UuidType = Uuid16Bits;
	}
	else
	{
		memcpy( req.Uuid.Uuid128Bits, uuid->data, 16 );
		req.UuidType = Uuid128Bits;
	}

	GATTDBDynamicAddPrimaryServiceDeclarationRequest( &req, BLE_FSCI_IF );
	xSemaphoreTake( gattDbConfirmMutex, 1000 / portTICK_PERIOD_MS );


	// Grab handle
	if ( !MK64F_FindServiceHandle( uuid, handle ) )
	{
		return false;
	}

	return true;
}

ATMO_BLE_Status_t ATMO_MK64F_BLE_GATTSAddService( ATMO_DriverInstanceData_t* instance, ATMO_BLE_Handle_t* handle,
        const char* serviceUUID )
{
	if((!mk64BleEnabledOnBoot) || (!mk64fBleEnabled))
	{
		return ATMO_BLE_Status_Fail;
	}

	ATMO_UUID_t uuid;

