ishotjr/WhenDi/ble/ble_mk64f.c
	if ( ATMO_StringToUuid( serviceUUID, &uuid, ATMO_ENDIAN_Type_Little ) == ATMO_Status_Success )
	{
		// Add service to the virtual database. When initialization is complete, this will be flushed to the KW41Z
		if ( !ATMO_BLE_DB_MK64F_AddService( &uuid, handle ) )
		{
			return ATMO_BLE_Status_Fail;
		}
	}
	else
	{
		return ATMO_BLE_Status_Fail;
	}


	return ATMO_BLE_Status_Success;
}

static bool ATMO_MK64F_BLE_RegisterWrittenCallbacks()
{
	if((!mk64BleEnabledOnBoot) || (!mk64fBleEnabled))
	{
		return ATMO_BLE_Status_Fail;
	}

	// Enable written callbacks on all characteristics
	ATMO_BLE_Handle_t handles[currentNumCharacteristics];
	uint8_t numHandles = 0;

	for ( int i = 0; i < currentNumCharacteristics; i++ )
	{
		if( characteristics[i].properties & ( ATMO_BLE_Property_Write | ATMO_BLE_Property_WriteWithoutResponse ) )
		{
			shell_printf("Properties: %02X\r\n", characteristics[i].properties);
			ATMO_BLE_DB_MK64F_AtmoHandleToKw41z( &characteristics[i].handle, &handles[numHandles] );
			shell_printf( "Registering cb for handle %04X\r\n", handles[numHandles] );
			numHandles++;
		}
	}

	ATMO_MK64F_BLE_RegisterForWriteNotifications( numHandles * sizeof( ATMO_BLE_Handle_t ), ( uint8_t* )handles );

	return true;
}

bool ATMO_MK64F_BLE_PrivAddCharacteristic( ATMO_UUID_t* charUuid, ATMO_BLE_Handle_t serviceHandle, uint8_t properties,
        uint8_t permissions, uint32_t maxLen, ATMO_BLE_Handle_t* handle )
{
	if((!mk64BleEnabledOnBoot) || (!mk64fBleEnabled))
	{
		return ATMO_BLE_Status_Fail;
	}

	GATTDBDynamicAddCharacteristicDeclarationAndValueRequest_t req;

	if( charUuid->type == ATMO_UUID_Type_16_Bit )
	{
		memcpy( req.Uuid.Uuid16Bits, charUuid->data, 2 );
		req.UuidType = Uuid16Bits;
	}
	else
	{
		memcpy( req.Uuid.Uuid128Bits, charUuid->data, 16 );
		req.UuidType = Uuid128Bits;
	}

	req.CharacteristicProperties = properties;
	req.MaxValueLength = maxLen;
	req.InitialValueLength = maxLen;

	req.InitialValue = ATMO_Malloc( maxLen );

	if ( req.InitialValue == NULL )
	{
		return false;
	}

	memset( req.InitialValue, 0, maxLen );

	req.ValueAccessPermissions = 0;

	if(permissions & ATMO_BLE_Permission_Read)
	{
		req.ValueAccessPermissions |=
		    GATTDBDynamicAddCharacteristicDeclarationAndValueRequest_ValueAccessPermissions_gPermissionFlagReadable_c;
	}
	if(permissions & ATMO_BLE_Permission_Write)
	{
		req.ValueAccessPermissions |=
		    GATTDBDynamicAddCharacteristicDeclarationAndValueRequest_ValueAccessPermissions_gPermissionFlagWritable_c;
	}

	GATTDBDynamicAddCharacteristicDeclarationAndValueRequest( &req, BLE_FSCI_IF );
	xSemaphoreTake( gattDbConfirmMutex, 1000 / portTICK_PERIOD_MS );

	ATMO_PLATFORM_DelayMilliseconds(50);

	if( properties & ( ATMO_BLE_Property_Notify | ATMO_BLE_Property_Indicate ) )
	{
		GATTDBDynamicAddCccdRequest( BLE_FSCI_IF );
	}

	ATMO_Free( req.InitialValue );

	ATMO_PLATFORM_DelayMilliseconds(50);

	// Grab handle from KW41Z
	if ( !MK64F_FindCharHandle( charUuid, serviceHandle, handle ) )
	{
		return false;
	}

	return true;
}

ATMO_BLE_Status_t ATMO_MK64F_BLE_GATTSAddCharacteristic( ATMO_DriverInstanceData_t* instance, ATMO_BLE_Handle_t* handle,
        ATMO_BLE_Handle_t serviceHandle,
        const char* characteristicUUID, uint8_t properties, uint8_t permissions, uint32_t maxLen )
{
	if((!mk64BleEnabledOnBoot) || (!mk64fBleEnabled))
	{
		return ATMO_BLE_Status_Fail;
	}

	ATMO_UUID_t uuid;

	if ( ATMO_StringToUuid( characteristicUUID, &uuid, ATMO_ENDIAN_Type_Little ) == ATMO_Status_Success )
	{
		// Add characteristic to virtual DB
		// This will be flushed to the KW41Z post init
		if ( !ATMO_BLE_DB_MK64F_AddCharacteristicToService( &serviceHandle, &uuid, properties, permissions, maxLen, handle ) )
		{
			return ATMO_BLE_Status_Fail;
		}

		characteristics[currentNumCharacteristics].handle = *handle;
		characteristics[currentNumCharacteristics].properties = properties;
		characteristics[currentNumCharacteristics++].initialized = false;
	}
	else
	{
		return ATMO_BLE_Status_Fail;
	}

	return ATMO_BLE_Status_Success;
}

ATMO_BLE_Status_t ATMO_MK64F_BLE_GATTSGetCharacteristicValue( ATMO_DriverInstanceData_t* instance, ATMO_BLE_Handle_t handle,
        uint8_t* valueBuf, uint32_t bufLen, uint32_t* valueLen )
{
	if((!mk64BleEnabledOnBoot) || (!mk64fBleEnabled))
	{
		return ATMO_BLE_Status_Fail;
	}

	GATTDBReadAttributeRequest_t req;
	ATMO_BLE_DB_MK64F_AtmoHandleToKw41z( &handle, &req.Handle );
	req.MaxBytes = ATMO_MAX_BLE_CHARACTERISTIC_SIZE;

	GATTDBReadAttributeRequest( &req, BLE_FSCI_IF );

	// Wait a second for the result to come back in
	if ( xSemaphoreTake( charReadMutex,
	                     1000 / portTICK_PERIOD_MS ) == pdTRUE )
	{
		memcpy( valueBuf, latestCharDataRead, latestCharDataReadSize <= bufLen ? latestCharDataReadSize : bufLen );
		*valueLen = latestCharDataReadSize;
	}
	else
	{
		return ATMO_BLE_Status_Fail;
	}

	return ATMO_BLE_Status_Success;

}

ATMO_BLE_Status_t ATMO_MK64F_BLE_GATTSRegisterCharacteristicCallback( ATMO_DriverInstanceData_t* instance,
        ATMO_BLE_Handle_t handle,
        ATMO_BLE_Characteristic_Event_t event, ATMO_Callback_t cb )
{
	if((!mk64BleEnabledOnBoot) || (!mk64fBleEnabled))
	{
		return ATMO_BLE_Status_Fail;
	}

	if ( event != ATMO_BLE_Characteristic_Written )
	{
		return ATMO_BLE_Status_NotSupported;
	}

	for ( uint32_t i = 0; i < currentNumCharacteristics; i++ )
	{
		if ( characteristics[i].handle == handle )
		{
			characteristics[i].callback = cb;
		}
	}

	return ATMO_BLE_Status_Success;
}

ATMO_BLE_Status_t ATMO_MK64F_BLE_GATTSRegisterCharacteristicAbilityHandle( ATMO_DriverInstanceData_t* instance,
        ATMO_BLE_Handle_t handle,
        ATMO_BLE_Characteristic_Event_t event, unsigned int abilityHandle )
{
	if((!mk64BleEnabledOnBoot) || (!mk64fBleEnabled))
	{
		return ATMO_BLE_Status_Fail;
	}

	if ( event != ATMO_BLE_Characteristic_Written )
	{
		return ATMO_BLE_Status_NotSupported;
	}

	for ( uint32_t i = 0; i < currentNumCharacteristics; i++ )
	{
		if ( characteristics[i].handle == handle )
		{
			characteristics[i].abilityHandle = abilityHandle;
			characteristics[i].abilityHandlerRegistered = true;
		}
	}

	return ATMO_BLE_Status_Success;
}

ATMO_BLE_Status_t ATMO_MK64F_BLE_PrivGATTSSetCharacteristic( ATMO_BLE_Handle_t handle,
        uint16_t length, uint8_t* value,
        ATMO_BLE_CharProperties_t* properties )
{
	if((!mk64BleEnabledOnBoot) || (!mk64fBleEnabled))
	{
		return ATMO_BLE_Status_Fail;
	}

