ishotjr/WhenDi/ble/ble_mk64f.c
	GATTDBWriteAttributeRequest_t req;
	req.Handle = handle;
	req.Value = value;
	req.ValueLength = length;
	GATTDBWriteAttributeRequest( &req, BLE_FSCI_IF );

	return ATMO_BLE_Status_Success;
}

ATMO_BLE_Status_t ATMO_MK64F_BLE_GATTSSetCharacteristic( ATMO_DriverInstanceData_t* instance, ATMO_BLE_Handle_t handle,
        uint16_t length, uint8_t* value,
        ATMO_BLE_CharProperties_t* properties )
{
	if((!mk64BleEnabledOnBoot) || (!mk64fBleEnabled))
	{
		return ATMO_BLE_Status_Fail;
	}

	if( length > ATMO_MAX_BLE_CHARACTERISTIC_SIZE || length == 0)
	{
		return ATMO_BLE_Status_Invalid;
	}

	ATMO_BLE_Handle_t kw41zHandle;
	ATMO_BLE_DB_MK64F_AtmoHandleToKw41z( &handle, &kw41zHandle );
	ATMO_CharacteristicInfo_t* characteristic = MK64F_GetCharacteristicByHandle( handle );
	characteristic->initialized = true;

	ATMO_BLE_Status_t retVal = ATMO_MK64F_BLE_PrivGATTSSetCharacteristic( kw41zHandle, length, value, properties );

	if( retVal != ATMO_BLE_Status_Success )
	{
		return retVal;
	}

	// Send notification
	if( characteristic->properties & ATMO_BLE_Property_Notify )
	{
		//shell_printf( "Sending notify on %02X\r\n", kw41zHandle );
		ATMO_MK64F_BLE_GATTSSendNotify( instance, handle, length, value );
	}

	if( characteristic->properties & ATMO_BLE_Property_Indicate )
	{
		ATMO_MK64F_BLE_GATTSSendIndicate( instance, handle, length, value );
	}

	return ATMO_BLE_Status_Success;
}

ATMO_BLE_Status_t ATMO_MK64F_BLE_GATTSWriteDescriptor( ATMO_DriverInstanceData_t* instance, ATMO_BLE_Handle_t handle,
        uint16_t length, uint8_t* value,
        ATMO_BLE_CharProperties_t* properties )
{
	return ATMO_BLE_Status_NotSupported;
}

ATMO_BLE_Status_t ATMO_MK64F_BLE_GATTSSendIndicate( ATMO_DriverInstanceData_t* instance, ATMO_BLE_Handle_t handle,
        uint16_t size, uint8_t* value )
{
	if((!mk64BleEnabledOnBoot) || (!mk64fBleEnabled))
	{
		return ATMO_BLE_Status_Fail;
	}

	// It's alright if we're not connected
	if( !currentlyConnected )
	{
		return ATMO_BLE_Status_Success;
	}

	ATMO_CharacteristicInfo_t* characteristic = MK64F_GetCharacteristicByHandle( handle );

	if( !characteristic->indicationsEnabled )
	{
		return ATMO_BLE_Status_Success;
	}

	ATMO_BLE_Handle_t kw41zHandle;
	ATMO_BLE_DB_MK64F_AtmoHandleToKw41z( &handle, &kw41zHandle );

	GATTServerSendIndicationRequest_t req;
	req.DeviceId = connectedDeviceId;
	req.Handle = kw41zHandle;

	GATTServerSendIndicationRequest( &req, BLE_FSCI_IF );
	return ATMO_BLE_Status_Success;
}

ATMO_BLE_Status_t ATMO_MK64F_BLE_GATTSSendNotify( ATMO_DriverInstanceData_t* instance, ATMO_BLE_Handle_t handle, uint16_t size, uint8_t *value )
{
	if((!mk64BleEnabledOnBoot) || (!mk64fBleEnabled))
	{
		return ATMO_BLE_Status_Fail;
	}

	// It's alright if we're not connected
	if( !currentlyConnected )
	{
		return ATMO_BLE_Status_Success;
	}

	ATMO_CharacteristicInfo_t* characteristic = MK64F_GetCharacteristicByHandle( handle );

	if( !characteristic->notificationsEnabled )
	{
		return ATMO_BLE_Status_Success;
	}

	ATMO_BLE_Handle_t kw41zHandle;
	ATMO_BLE_DB_MK64F_AtmoHandleToKw41z( &handle, &kw41zHandle );

	if(value != NULL && size > 0)
	{
		ATMO_MK64F_BLE_PrivGATTSSetCharacteristic( kw41zHandle, size, value, NULL );
	}

	GATTServerSendNotificationRequest_t req;
	req.DeviceId = connectedDeviceId;
	req.Handle = kw41zHandle;

	GATTServerSendNotificationRequest( &req, BLE_FSCI_IF );
	return ATMO_BLE_Status_Success;
}

ATMO_BLE_Status_t ATMO_MK64F_BLE_GATTCDiscoverService( ATMO_DriverInstanceData_t* instance,
        ATMO_BLE_ServiceHandle_t serviceUUID, ATMO_BLE_ScanResults_t* result )
{
	return ATMO_BLE_Status_NotSupported;
}

ATMO_BLE_Status_t ATMO_MK64F_BLE_GATTCWriteCharacteristic( ATMO_DriverInstanceData_t* instance, ATMO_BLE_Handle_t handle,
        uint16_t size, uint8_t* value )
{
	return ATMO_BLE_Status_NotSupported;
}

ATMO_BLE_Status_t ATMO_MK64F_BLE_GATTCReadCharacteristic( ATMO_DriverInstanceData_t* instance, ATMO_BLE_Handle_t handle,
        uint16_t size, uint8_t* payload )
{
	return ATMO_BLE_Status_NotSupported;
}

ATMO_BLE_Status_t ATMO_MK64F_BLE_GATTCEnableNotification( ATMO_DriverInstanceData_t* instance, ATMO_BLE_Handle_t handle,
        bool indicate )
{
	return ATMO_BLE_Status_NotSupported;
}

ATMO_BLE_Status_t ATMO_MK64F_BLE_RegisterEventCallback( ATMO_DriverInstanceData_t *instance, ATMO_BLE_Event_t event, ATMO_Callback_t cb)
{
	if(_mk64BleEventNumCallbacks[event] >= ATMO_BLE_NUM_CALLBACKS_PER_EVENT)
	{
		return ATMO_BLE_Status_Fail;
	}

	_mk64BleEventCallback[event][_mk64BleEventNumCallbacks[event]++] = cb;

	return ATMO_BLE_Status_Success;
}

ATMO_BLE_Status_t ATMO_MK64F_BLE_RegisterEventAbilityHandle( ATMO_DriverInstanceData_t *instance, ATMO_BLE_Event_t event, unsigned int abilityHandle)
{
	if(_mk64BleEventNumAbilityHandles[event] >= ATMO_BLE_NUM_CALLBACKS_PER_EVENT)
	{
		return ATMO_BLE_Status_Fail;
	}

	_mk64BleEventAbilityHandle[event][_mk64BleEventNumAbilityHandles[event]++] = abilityHandle;

	return ATMO_BLE_Status_Success;
}
